app/Controllers/PagoController.php

SELECT *
FROM `pagos`
---
    public function index() {
        $pagos = $this->pagoModel->findAll();

SELECT *
FROM `pagos`
WHERE `pagos`.`id` = '54'
---
    public function show($id) {
        $pago = $this->pagoModel->find($id);

SELECT *
FROM `pagos`
WHERE `pedido_id` = '10'
 LIMIT 1
SELECT *
FROM `pagos`
WHERE `id_transaccion` = '5'
 LIMIT 1
---
    public function store() {
        // Obtener los datos del formulario
        $pedido_id = $this->request->getPost("pedido_id");
        $id_transaccion = $this->request->getPost("id_transaccion");

        // Verificar si el pedido_id ya existe en la base de datos
        $existingPago = $this->pagoModel->where('pedido_id', $pedido_id)->first();
        if ($existingPago) {
            // Si existe, redirigir con mensaje de error
            return redirect()->back()->with('error', 'El ID de pedido ya está registrado.');
        }

        // Verificar si el id_transaccion ya existe en la base de datos
        $existingTransaccion = $this->pagoModel->where('id_transaccion', $id_transaccion)->first();

SELECT *
FROM `pagos`
WHERE `pagos`.`id` = '54'
---
    public function edit($id) {
        $pago = $this->pagoModel->find($id);

UPDATE `pagos` SET `cantidad_pagada` = '555.00', `pedido_id` = '100', `id_transaccion` = '100', `metodo` = 'mercadopago', `updated_at` = '2024-12-04 05:00:14'
WHERE `pagos`.`id` IN ('54')
---
    public function update($id) {
        $data = array(
            "cantidad_pagada" => $this->request->getPost("cantidad_pagada"),
            "pedido_id" => $this->request->getPost("pedido_id"),
            "id_transaccion" => $this->request->getPost("id_transaccion"),
            "metodo" => $this->request->getPost("metodo"),
            "updated_at" => date('Y-m-d H:i:s'),
        );

        $this->pagoModel->update($id, $data);

DELETE FROM `pagos`
WHERE `id` IN ('55')
---
    public function delete($id) {
        $this->pagoModel->delete($id);