writable/uploads/pagos/app/Controllers/PagoController.php

SELECT *
FROM `pagos`
---
    public function index() {
        $pagos = $this->pagoModel->findAll();

SELECT *
FROM `pagos`
WHERE `pagos`.`id` = '1'
---
    public function show($id) {
        $pago = $this->pagoModel->find($id);

INSERT INTO `pagos` (`cantidad_pagada`, `pedido_id`, `id_transaccion`, `metodo`, `created_at`, `updated_at`) VALUES ('800', '53', '4', 'transferencia', '2024-11-28 23:20:18', '2024-11-28 23:20:18')
---
    public function store() {
        $data = array(
            "cantidad_pagada" => $this->request->getPost("cantidad_pagada"),
            "pedido_id" => $this->request->getPost("pedido_id"),
            "id_transaccion" => $this->request->getPost("id_transaccion"),
            "metodo" => $this->request->getPost("metodo"),
            "created_at" => date('Y-m-d H:i:s'),
            "updated_at" => date('Y-m-d H:i:s'),
        );

        $this->pagoModel->save($data);

SELECT *
FROM `pagos`
WHERE `pagos`.`id` = '1'
---
    public function edit($id) {
        $pago = $this->pagoModel->find($id);